adherece_oracle/app/controllers/api/he1/patient_devices_controller.rb

SELECT "patient_devices".* FROM "patient_devices" WHERE "patient_devices"."patient_id" = $1 ORDER BY id  [["patient_id", 10]]
---
  def index
    @patient_devices = @patient.patient_devices.order("id")

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_device
      @patient_device = PatientDevice.find(params[:id])