adherece_oracle/app/controllers/api/he1/registrations_controller.rb

SELECT  "patients".* FROM "patients" WHERE "patients"."registration_code" = $1 ORDER BY "patients"."id" ASC LIMIT $2  [["registration_code", "WSDDDDF"], ["LIMIT", 1]]
SELECT  "patients".* FROM "patients" ORDER BY "patients"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def register_user
    # JDavis: need to find the patient with the reg_code.
    @patient = Patient.where(registration_code: params[:reg_code]).first

    # JDavis: Need to confirm it is an authorized device.
    # JDavis: Should capture multiple device_uuids.
    # @patient.capture_device_uuid(request.headers["x-device-uuid"]) unless @patient.device_uuid.present?

    # JDavis: not sure about checking the device_uuid
    if @patient # && @patient.device_uuid.present? && (@patient.device_uuid == request.headers["x-device-uuid"])