adherece_oracle/app/views/patient_devices/_form.html.erb

      <%= f.label :device_id %>
      <%= f.collection_select :device_id, Device.all, :id, :full_name, {prompt:'select device'}, {class: "regular_select"} %>
---
SELECT "devices".* FROM "devices"