adherece_oracle/app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices"
---
  def index
    @devices = Device.all

INSERT INTO "devices" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Glucose Meter"], ["created_at", 2017-09-10 21:20:18 UTC], ["updated_at", 2017-09-10 21:20:18 UTC]]
---
  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save

UPDATE "devices" SET "manufacturer" = $1, "model" = $2, "updated_at" = $3 WHERE "devices"."id" = $4  [["manufacturer", "Fitbit"], ["model", ""], ["updated_at", 2017-09-11 03:53:20 UTC], ["id", 5]]
---
  def update
    respond_to do |format|
      if @device.update(device_params)

DELETE FROM "devices" WHERE "devices"."id" = $1  [["id", 8]]
---
  def destroy
    @device.destroy

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_device
      @device = Device.find(params[:id])