adherece_oracle/app/controllers/meals_controller.rb

  def index
    @meals = Meal.all
---
SELECT "meals".* FROM "meals"