adherece_oracle/app/controllers/patients_controller.rb

SELECT "readings".* FROM "readings" WHERE "readings"."patient_id" = $1 ORDER BY device_date DESC  [["patient_id", 11]]
---
  def show
    @readings = @patient.readings.order('device_date DESC')

INSERT INTO "patients" ("email", "active", "registration_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "patient1@test.com"], ["active", true], ["registration_code", "YREUZN"], ["created_at", 2017-07-12 19:39:41 UTC], ["updated_at", 2017-07-12 19:39:41 UTC]]
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_patient
      @patient = Patient.find(params[:id])