adherece_oracle/app/controllers/patient_devices_controller.rb

  def create
    #@patient_device = PatientDevice.new(patient_device_params)
    @patient_device = @patient.patient_devices.new(patient_device_params)

    respond_to do |format|
      if @patient_device.save
---
INSERT INTO "patient_devices" ("patient_id", "device_id", "serial_number", "created_at", "updated_at", "mac_address") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["patient_id", 22], ["device_id", 4], ["serial_number", ""], ["created_at", 2017-09-11 01:40:15 UTC], ["updated_at", 2017-09-11 01:40:15 UTC], ["mac_address", ""]]

  def destroy
    @patient_device.destroy
---
DELETE FROM "patient_devices" WHERE "patient_devices"."id" = $1  [["id", 7]]

    def set_patient_device
      @patient_device = PatientDevice.find(params[:id])
---
SELECT  "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "patient_devices".* FROM "patient_devices" WHERE "patient_devices"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def set_patient
      @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]