adherece_oracle/app/controllers/readings_controller.rb

  def index
    @readings = Reading.all
---
SELECT "readings".* FROM "readings"

  def update
    respond_to do |format|
      if @reading.update(reading_params)
---
UPDATE "readings" SET "value1" = $1, "updated_at" = $2 WHERE "readings"."id" = $3  [["value1", 110.3], ["updated_at", 2017-08-12 20:59:19 UTC], ["id", 11]]

  def destroy
    @reading.destroy
---
DELETE FROM "readings" WHERE "readings"."id" = $1  [["id", 1]]

    def set_reading
      @reading = Reading.find(params[:id])
---
SELECT  "readings".* FROM "readings" WHERE "readings"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    def set_patient
      @patient = Patient.find(params[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]