adherece_oracle/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.skip_password_validation = true
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "confirmation_token", "confirmation_sent_at", "created_at", "updated_at", "first_name", "last_name", "address1", "address2", "city", "state", "zip", "parish") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "address1" = $3, "address2" = $4, "city" = $5, "state" = $6, "zip" = $7, "parish" = $8, "updated_at" = $9 WHERE "users"."id" = $10